if OS.mac?
    # Applications
    cask "kitty" # a better terminal emulator
elsif OS.linux?
end

# packages
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "git" # Git version control (latest version)
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "jq" # work with JSON files in shell scripts
brew "neovim" # A better vim
brew "python" # python (latst)
brew "ripgrep" # very fast file searcher
brew "fnm" # Fast Node version manager
brew "shellcheck" # diagnostics for shell sripts
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "z" # switch between most used directories
brew "zsh" # zsh (latest) 
brew "git-secrets" # prevent committing secrets to git repos
brew "reattach-to-user-namespace" # reliable access to MacOS pasteboard when in tmux
brew "diff-so-fancy" # nicer git diffs
brew "rbenv"
brew "ruby-build"
brew "direnv"
